In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./nse5paisaScriptMaster.csv")

In [3]:
df.head()

,Exch,ExchType,Scripcode,Name,Series,Expiry,CpType,StrikeRate,WireCat,ISIN,FullName
0,N,D,49343,NIFTY 31 Mar 2022 CE 18000.00 ...,XX,2022-03-31 14:30:00,CE,18000.0,,NIFTY,NIFTY 31 Mar 2022 CE 18000.00
1,N,D,49344,NIFTY 31 Mar 2022 PE 18000.00 ...,XX,2022-03-31 14:30:00,PE,18000.0,,NIFTY,NIFTY 31 Mar 2022 PE 18000.00
2,N,D,49345,BANKNIFTY 30 Sep 2021 CE 36800.00 ...,XX,2021-09-30 14:30:00,CE,36800.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 CE 36800.00
3,N,D,49346,BANKNIFTY 30 Sep 2021 PE 36800.00 ...,XX,2021-09-30 14:30:00,PE,36800.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 PE 36800.00
4,N,D,49347,BANKNIFTY 30 Sep 2021 CE 36900.00 ...,XX,2021-09-30 14:30:00,CE,36900.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 CE 36900.00

In [4]:
df.columns

Index(['Exch', 'ExchType', 'Scripcode', 'Name', 'Series', 'Expiry', 'CpType',
       'StrikeRate', 'WireCat', 'ISIN', 'FullName'],
      dtype='object')

In [5]:
df1=df[(df["Exch"]=="N") & (df["Series"]=="EQ")].copy()

In [6]:
df1

,Exch,ExchType,Scripcode,Name,Series,Expiry,CpType,StrikeRate,WireCat,ISIN,FullName
529,N,C,4,21STCENMGM ...,EQ,1980-01-01 00:00:00,XX,0.0,Z,INE253B01015,21ST CENTURY MGMT SERVICE
531,N,C,7,AARTIIND ...,EQ,1980-01-01 00:00:00,XX,0.0,B,INE769A01020,AARTI INDUSTRIES LTD
533,N,C,10,ABAN ...,EQ,1980-01-01 00:00:00,XX,0.0,Z,INE421A01028,ABAN OFFSHORE LTD.
536,N,C,13,ABB ...,EQ,1980-01-01 00:00:00,XX,0.0,A,INE117A01022,ABB INDIA LIMITED
538,N,C,17,SCAPDVR ...,EQ,1980-01-01 00:00:00,XX,0.0,Z,INE224E01036,STAMPEDE CAPITAL LIMITED
...,...,...,...,...,...,...,...,...,...,...,...
86526,N,C,31258,NDL ...,EQ,1980-01-01 00:00:00,XX,0.0,Z,INE875G01030,NANDAN DENIM LIMITED
86527,N,C,31409,MTEDUCARE ...,EQ,1980-01-01 00:00:00,XX,0.0,Z,INE472M01018,MT EDUCARE LTD
86528,N,C,31415,NBCC ...,EQ,1980-01-01 00:00:00,XX,0.0,B,INE095N01031,NBCC (INDIA) LIMITED
86530,N,C,31468,LYPSAGEMS ...,EQ,1980-01-01 00:00:00,XX,0.0,Z,INE142K01011,LYPSA GEMS & JEWEL LTD
86531,N,C,31475,ORBTEXP ...,EQ,1980-01-01 00:00:00,XX,0.0,Z,INE231G01010,ORBIT EXPORTS LIMITED

In [11]:
df1["Name"] = df1["Name"].str.strip()

In [12]:
df1[df1["Name"]== "NIFTY"]

,Exch,ExchType,Scripcode,Name,Series,Expiry,CpType,StrikeRate,WireCat,ISIN,FullName
3760,N,C,999920000,NIFTY,EQ,1980-01-01 00:00:00,EQ,0.0,Z,NaN,NIFTY ...

In [13]:
df1[df1["Name"]== "NIFTY"]['FullName']

3760    NIFTY                                         ...
Name: FullName, dtype: object

In [14]:
df1[df1["Name"]== "BANKNIFTY"]

,Exch,ExchType,Scripcode,Name,Series,Expiry,CpType,StrikeRate,WireCat,ISIN,FullName
3765,N,C,999920005,BANKNIFTY,EQ,1980-01-01 00:00:00,EQ,0.0,Z,NaN,BANKNIFTY ...

In [15]:
locals().get("asin" , None)

In [18]:
x = 10